In [0]:
# import stuffs
import pandas as pd
import matplotlib.pyplot as plt

In [0]:
# load data
all_ages = pd.read_csv('https://raw.githubusercontent.com/ccny-data/College_Major_Data/master/data/fivethirtyeight-college-majors-dataset/all-ages.csv')
grad_students = pd.read_csv('https://raw.githubusercontent.com/ccny-data/College_Major_Data/master/data/fivethirtyeight-college-majors-dataset/grad-students.csv')
majors_list = pd.read_csv('https://raw.githubusercontent.com/ccny-data/College_Major_Data/master/data/fivethirtyeight-college-majors-dataset/majors-list.csv')
recent_grads = pd.read_csv('https://raw.githubusercontent.com/ccny-data/College_Major_Data/master/data/fivethirtyeight-college-majors-dataset/recent-grads.csv')
women_stem = pd.read_csv('https://raw.githubusercontent.com/ccny-data/College_Major_Data/master/data/fivethirtyeight-college-majors-dataset/women-stem.csv')

In [3]:
all_ages.head()

   Major_code                                  Major  ...  P25th    P75th
0        1100                    GENERAL AGRICULTURE  ...  34000  80000.0
1        1101  AGRICULTURE PRODUCTION AND MANAGEMENT  ...  36000  80000.0
2        1102                 AGRICULTURAL ECONOMICS  ...  40000  98000.0
3        1103                        ANIMAL SCIENCES  ...  30000  72000.0
4        1104                           FOOD SCIENCE  ...  38500  90000.0

[5 rows x 11 columns]

In [4]:
grad_students.head()

   Major_code                                   Major  ... Grad_share  Grad_premium
0        5601                   CONSTRUCTION SERVICES  ...   0.096320      0.153846
1        6004       COMMERCIAL ART AND GRAPHIC DESIGN  ...   0.104420      0.250000
2        6211                  HOSPITALITY MANAGEMENT  ...   0.119837      0.300000
3        2201  COSMETOLOGY SERVICES AND CULINARY ARTS  ...   0.125878      0.129808
4        2001              COMMUNICATION TECHNOLOGIES  ...   0.144753      0.096154

[5 rows x 22 columns]

In [5]:
majors_list.head()

  FOD1P                                  Major                   Major_Category
0  1100                    GENERAL AGRICULTURE  Agriculture & Natural Resources
1  1101  AGRICULTURE PRODUCTION AND MANAGEMENT  Agriculture & Natural Resources
2  1102                 AGRICULTURAL ECONOMICS  Agriculture & Natural Resources
3  1103                        ANIMAL SCIENCES  Agriculture & Natural Resources
4  1104                           FOOD SCIENCE  Agriculture & Natural Resources

In [6]:
recent_grads.head()

   Rank  Major_code  ... Non_college_jobs  Low_wage_jobs
0     1        2419  ...              364            193
1     2        2416  ...              257             50
2     3        2415  ...              176              0
3     4        2417  ...              102              0
4     5        2405  ...             4440            972

[5 rows x 21 columns]

In [7]:
women_stem.head()

   Rank  Major_code  ... ShareWomen  Median
0     1        2419  ...   0.120564  110000
1     2        2416  ...   0.101852   75000
2     3        2415  ...   0.153037   73000
3     4        2417  ...   0.107313   70000
4     5        2418  ...   0.144967   65000

[5 rows x 9 columns]